/*
Задание: Напишите фрагмент кода (группу комманд), который будет присваивать значения 5 и 9 двум переменным, а затем третья переменная будет получать значение, равное сумме значений первых двух переменных. Вывести на экран значение третьей переменной.
*/
 
// let a = 5,
//     b = 9,
//     c = a + b;
// alert (`Значение третьей переменой: ${c}»`); 

// id задания: 12 Не сдано
// Задание: Напишите фрагмет кода который будет присваивать значение 7.5 переменной х, а затем переменным a и b будет присваивать значения вдвое и втрое (соответственно) большие значения переменной х. Вывести эти значения на экран.

// let x = 7.5,
//     a = x * 2,
//     b = x * 3;
// alert (`Дана переменная х = ${x}. Значение переменой a = ${a}. Значение переменой b = ${b}»`); 


// id задания: 15 Не сдано
// Задание: Напишите фрагмент кода, который присваивает переменной х значение 9, а затем выводит на экран: в первой строке – это значение с поясняющей надписью (например, «значение х равно 9»), а во второй – квадрат этого значения (тоже с поясняющей надписью).
// let x = 9,
//     y = x * x;
// alert (`Значение х = ${x}. \nКвадрат этого значения = ${y}`);

/* 
id задания: 16 Не сдано
Задание: Напишите фрагмент кода, который принимает от пользователя число и выводит на экран число, которое больше введенного с клавиатуры на 10. */

// let a = prompt(`Введите число`, ),
//     b = a * 10;  
// alert (`Результат операции = ${b}`); 

/*id задания: 14
 Напишите фрагмент кода, который присваивает переменной х значение типа Number, а затем присваивает переменной треть от значения переменной х. Выводить результат на экран.
*/

// let x = Number(666.333);
// alert (`Дана переменная х = ${x}.\nЗначение переменой изменено и x = ${x = x/3}.`); 


// id задания: 18 Не сдано
// Задание: Напишите фрагмент кода, который принимает от пользователя число и выводит на экран новое число, которое больше введенного с клавиатуры в 10 раз.

// let a = prompt(`Введите число`, ),
//     b = a * 10;  
// alert (`Результат операции = ${b}`); 

// id задания: 19 Не сдано
// Задание: Напишите код, который принимает от пользователя число и затем выводит на экран следующие три значения (все – в одной строке, разделенные пробелом): число, меньше введенного с клавиатуры на 1, число, введенное с клавиатуры, и число, больше введенного с клавиатуры на 1.

// let a = prompt(`Введите число`, );
// alert (`${a-1} ${a} ${+a+1}`); 

// id задания: 20 Не сдано
// Задание: Напишите код, который принимает от пользователя число, представляющее собой массу тела в граммах, и выводящую на экран массу этого тела в килограммах.

// let a = prompt(`Введите массу тела в граммах`, );
// alert (`Массу этого тела в килограммах:${(a/1000).toFixed(0)} кг`); 

// d задания: 21 Не сдано
// Задание: Напишите код, который принимает от пользователя число, представляющее собой промежуток времени в часах, и выводит на экран этот же промежуток времени, но выраженный в секундах.

